<?php

namespace Database\Seeders;

use App\Models\Review;
use Carbon\Carbon;
use Illuminate\Database\Seeder;

class ReviewSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'name' => 'Николай',
                'text' => 'Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем. Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем.<br> <br>Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие.',
                'active' => true,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ],
            [
                'name' => 'Николай',
                'text' => 'Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем. Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем.<br> <br>Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие.',
                'active' => true,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ],
            [
                'name' => 'Николай',
                'text' => 'Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем. Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем.<br> <br>Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие.',
                'active' => true,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ],
            [
                'name' => 'Николай',
                'text' => 'Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем. Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем.<br> <br>Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие.',
                'active' => true,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ],
            [
                'name' => 'Николай',
                'text' => 'Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем. Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем.<br> <br>Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие.',
                'active' => true,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ],
            [
                'name' => 'Николай',
                'text' => 'Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем. Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем.<br> <br>Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие.',
                'active' => true,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ],
            [
                'name' => 'Николай',
                'text' => 'Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем. Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие. Большое Вам спасибо за Вашу работу, очень выручаете. Рекомендую всем.<br> <br>Второй год пользуюсь Вашими услугами. Очень довольна. Заказ привозят вовремя, продукты очень свежие.',
                'active' => true,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ],

        ];
        Review::insert($data);
        //
    }
}
